backend/controllers/CanshuController.php

    public function actionIndex($classid=0){
        $model = SlCanshu::find()->where(['classid'=>$classid])->all();
---
SELECT * FROM `sl_canshu` WHERE `classid`='4'

    public function actionAdd($classid=0){
        $model = new SlCanshu();
        $request = \Yii::$app->request;
        if ($request->isPost){
            $model->load($request->post(),'');
//            var_dump($model);die;
            if ($model->validate()){
                $model->save();
                return $this->redirect(Url::to(['index','classid'=>$classid]));
            }else{
                var_dump($model->getErrors());die;
            }
        }
        $parents = SlCanshu::find()->select(['id','u1'])->all();
---
SELECT `id`, `u1` FROM `sl_canshu`

    public function actionEdit($id){
        $model = SlCanshu::findOne(['id'=>$id]);
        $request = \Yii::$app->request;
        if ($request->isPost){
            $model->load($request->post(),'');
            if ($model->validate()){
                $model->save();
                return $this->redirect(['index']);
            }else{
                var_dump($model->getErrors());die;
            }
        }
        $parents = SlCanshu::find()->select(['id','u1'])->all();
---
SELECT * FROM `sl_canshu` WHERE `id`='15'
UPDATE `sl_canshu` SET `u1`='性别' WHERE `id`='15'
SELECT `id`, `u1` FROM `sl_canshu`