backend/controllers/FiledController.php

SELECT * FROM `sl_filed` WHERE (`model_id`='94') AND (`u5`=1)
---
    public function actionIndex($model_id){
        $model = SlFiled::find()->where(['model_id'=>$model_id])->andWhere(['u5'=>1])->all();

INSERT INTO `sl_filed` (`model_id`, `u2`, `u1`, `u4`, `u5`, `u7`, `u8`, `u9`, `u10`) VALUES ('94', '性别', 'xingbie', '1', '1', '性别', '', '', '')
SELECT * FROM `sl_canshu` WHERE `classid`=7
---
    public function actionAdd($model_id){
        $model = new SlFiled();
        $request = \Yii::$app->request;
        if ($request->isPost){
            $model->model_id = $model_id;
            $model->load($request->post(),'');
            if ($model->validate()){
                //给表添加字段
                $table = new CreateTable();
                $tableName = $model->table->u1;
                $table->addColumn($tableName,$model);
                $model->save();
                return $this->redirect(['index','model_id'=>$model_id]);
            }else{
                var_dump($model->getErrors());exit;
            }
        }
        //字段类型
        $types = SlCanshu::find()->where(['classid'=>7])->all();

SELECT * FROM `sl_filed` WHERE `id`='11'
SELECT * FROM `sl_canshu` WHERE `classid`=7
---
    public function actionEdit($model_id,$id){
        $model = SlFiled::findOne(['id'=>$id]);
        $oldColumn = $model->u1;
        $request = \Yii::$app->request;
        if ($request->isPost){
            $model->model_id = $model_id;
            $model->load($request->post(),'');
            $tableName = $model->table->u1;
            if ($model->validate()){
                //修改对应表结构
                $table = new CreateTable();
                //修改表字段
                $table->updateColumn($tableName,$model,$oldColumn);
                $model->save();
                return $this->redirect(['index','model_id'=>$model_id]);
            }else{
                var_dump($model->getErrors());exit;
            }
        }
        //字段类型
        $types = SlCanshu::find()->where(['classid'=>7])->all();

SELECT * FROM `sl_filed` WHERE `id`='12'
DELETE FROM `sl_filed` WHERE `id`='12'
---
    public function actionDel($id,$model_id){
        $model = SlFiled::findOne(['id'=>$id]);
        if ($model){
            //删除数据表字段
            $table = new CreateTable();
            $tableName = $model->table->u1;
            $name = $model->u1;
            $table->delColumn($tableName,$name);
            $model->delete();

SELECT * FROM `sl_filed` WHERE `u1`='nianling'
---
    public function actionZh2py($model_id){
        $zh_str = \Yii::$app->request->post('zh_str');
        if(!isset($model_id))
        {
            return '{"code": 0,"content": "缺少model_id"}';
        }
        //汉字转拼音
        $str=CUtf8_PY::encode($zh_str,"all");
        $test = SlFiled::find()->where(['u1'=>$str])->all();