backend/controllers/IndexController.php

SELECT COUNT(*) FROM `jnc_admin` WHERE ((`username` LIKE '%.com%') OR (`name` LIKE '%.com%')) OR (`really_name` LIKE '%.com%')
SELECT * FROM `jnc_admin` WHERE ((`username` LIKE '%.com%') OR (`name` LIKE '%.com%')) OR (`really_name` LIKE '%.com%') LIMIT 10
---
    public function actionList($search,$page=1){
        if ($search==''){
            $query = Admin::find();
        }else{
            $query = Admin::find()->orWhere(['like','username',$search])->orWhere(['like','name',$search])->orWhere(['like','really_name',$search]);
        }
        $offset = \Yii::$app->request->post('offset');
        $offset = isset($offset)?$offset:10;
        $count = $query->count();
        $total = ceil($count/$offset);
        $start = ($page-1)*$offset;
        $model = $query->limit($offset)->offset($start)->all();