backend/controllers/ModelController.php

    public function actionIndex($page=1){
        $query = SlMoxing::find();
        //分页查询
        $offset = 10;
        $count = $query->count();
        //总页数
        $total = ceil($count/$offset);
        $start = ($page-1)*$offset;
        $model = $query->limit($offset)->offset($start)->all();
---
SELECT COUNT(*) FROM `sl_moxing`
SELECT * FROM `sl_moxing` LIMIT 10

    public function actionAdd(){
        $model = new SlMoxing();
        $request = \Yii::$app->request;
        if($request->isPost){
            $model->load($request->post(),'');
            if ($model->validate()){
                //保存模型数据
                $model->save();
                $model_id = \Yii::$app->db->getLastInsertID();
                //验证通过创建数据表
                $create_model = new CreateTable();
                $canshu = SlCanshu::findOne(['id'=>$model->u3]);
---
INSERT INTO `sl_moxing` (`u1`, `u2`, `u3`) VALUES ('test', 'test', '6')
SELECT * FROM `sl_canshu` WHERE `id`='6'

            }
        }
        //获取模型类型参数
        $canshu = SlCanshu::find()->where(['classid'=>4])->all();
---
SELECT * FROM `sl_canshu` WHERE `classid`=4

    public function actionTest(){
        $fileds = SlFiled::find()->where(['model_id'=>94])->andWhere(['u5'=>1])->asArray()->all();
---
SELECT * FROM `sl_filed` WHERE (`model_id`=94) AND (`u5`=1)