backend/controllers/VoteController.php

SELECT * FROM `cb_action`
---
    public function actionIndex(){
        $data = CbAction::find()->asArray()->all();