backend/models/CreateTable.php

    public function autoAdd($model_id,$data=[]){
        foreach ($data as $v){
            $model = new SlFiled();
            $model->model_id = $model_id;
            $model->u1=$v['u1'];
            $model->u2=$v['u2'];
            $model->u4=$v['u4'];
            $model->u5=$v['u5'];
            $model->u6=$v['u6'];
            $model->u7=$v['u7'];
            $model->save();
---
INSERT INTO `sl_filed` (`model_id`, `u1`, `u2`, `u4`, `u5`, `u6`, `u7`) VALUES ('95', 'create_time', '添加时间', '1', '1', '0', '时间框')